<a href="https://colab.research.google.com/github/ejrtks1020/Bigdata_Analysis_Certification/blob/main/T1_21_%EA%B5%AC%EA%B0%84_%EB%B6%84%ED%95%A0_Expected_Question.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

나이 구간 나누기

basic1 데이터 중 'age'컬럼 이상치를 제거하고, 동일한 개수로 나이 순으로 3그룹으로 나눈 뒤 각 그룹의 중앙값을 더하시오

In [ ]:
import pandas as pd

df = pd.read_csv('basic1.csv')

In [ ]:
df['age'].describe()

count    100.000000
mean      50.963000
std       30.442759
min      -13.500000
25%       26.875000
50%       52.500000
75%       77.000000
max      100.000000
Name: age, dtype: float64

In [ ]:
index = df[df['age'] <= 0].index

In [ ]:
df2 = df.drop(index = index, axis = 0)

In [ ]:
df.shape, df2.shape

((100, 8), (96, 8))

In [ ]:
df3 = df2.sort_values(by = 'age')
df3

      id    age city     f1  f2   f3    f4         f5
98  id99    1.0   경기   47.0   0  NaN  ESFJ  97.381034
0   id01    2.0   서울    NaN   0  NaN  ENFJ  91.297791
85  id86    2.0   경기    NaN   0  NaN  ESTP  29.269869
56  id57    3.0   대구  111.0   0  NaN  ISFJ  29.269869
8   id09    3.3   서울   35.0   2  NaN  ESFJ  17.252986
..   ...    ...  ...    ...  ..  ...   ...        ...
91  id92   97.0   경기   78.0   1  NaN  INFP  97.381034
51  id52   97.0   대구   82.0   1  NaN  ISFJ  90.496999
44  id45   97.0   대구   88.0   0  NaN  ENFJ  13.049921
36  id37  100.0   부산    NaN   0  NaN  ESTP  33.308999
96  id97  100.0   경기    NaN   0  NaN  INFP  67.886373

[96 rows x 8 columns]

In [ ]:
df3.groupby('age')

In [ ]:
print("전체 데이터: ", df.shape)
df2 = df[df['age'] > 0]
print("0보다 작거나 같은 값 제거후 데이터 크기: ", df2.shape)

df3 = df2[(df2['age'] == round(df2['age'], 0))]
print("소수점 제거 후 데이터 크기: ", df3.shape)

전체 데이터:  (100, 8)
0보다 작거나 같은 값 제거후 데이터 크기:  (96, 8)
소수점 제거 후 데이터 크기:  (90, 8)

In [ ]:
sum(~(df['age'] == round(df['age'], 0)))

8

In [ ]:
df[~(df['age'] == round(df['age'], 0))]

      id   age city    f1  f2   f3    f4         f5
6   id07  36.3   서울  60.0   1  NaN  ISFJ   9.796378
8   id09   3.3   서울  35.0   2  NaN  ESFJ  17.252986
21  id22  -6.3   부산  72.0   1  NaN  ENFP  52.667078
28  id29 -13.5   부산  47.0   2  NaN  ENTP  67.886373
46  id47  34.6   대구  75.0   1  NaN  ESTJ  90.496999
64  id65  26.5   경기   NaN   0  NaN  ISFP  91.297791
84  id85  83.6   경기  55.0   0  NaN  INFJ  80.138280
92  id93  21.8   경기  57.0   0  NaN  ISFP  73.586397

In [ ]:
#기준 확인
pd.qcut(df3['age'], q = 3)

0      (0.999, 38.667]
1      (0.999, 38.667]
2      (0.999, 38.667]
3      (73.333, 100.0]
4      (0.999, 38.667]
            ...
95     (73.333, 100.0]
96     (73.333, 100.0]
97    (38.667, 73.333]
98     (0.999, 38.667]
99    (38.667, 73.333]
Name: age, Length: 90, dtype: category
Categories (3, interval[float64]): [(0.999, 38.667] < (38.667, 73.333] < (73.333, 100.0]]

In [ ]:
#구간 분할
df['range'] = pd.qcut(df3['age'], q = 3, labels =['group1', 'group2', 'group3'])

In [ ]:
#수량 비교
df['range'].value_counts()

group3    30
group2    30
group1    30
Name: range, dtype: int64

In [ ]:

g1_median = df[df['range'] == 'group1']['age'].median()
g2_median = df[df['range'] == 'group2']['age'].median()
g3_median = df[df['range'] == 'group3']['age'].median()
print(g1_median + g2_median + g3_median)

165.0